app/controllers/api/v1/ideas_controller.rb

  def index
    render json: Idea.all
---
SELECT "ideas".* FROM "ideas"