app/controllers/api/v1/ideas_controller.rb

SELECT "ideas".* FROM "ideas"  ORDER BY "ideas"."created_at" ASC
---
  def index
    render json: Idea.order(created_at: :asc)

INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "a"], ["body", "b"], ["created_at", "2016-06-29 20:35:53.232257"], ["updated_at", "2016-06-29 20:35:53.232257"]]
---
  def create
    idea = Idea.new(idea_params)
    if idea.save

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 94]]
---
  def update
    @idea = Idea.find_by(id: params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 96]]
---
  def upvote
    @idea = Idea.find_by(id: params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 95]]
---
  def downvote
    @idea = Idea.find_by(id: params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 105]]
UPDATE "ideas" SET "body" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["body", "Replacing this with words that are actually words."], ["updated_at", "2016-06-29 05:55:23.705680"], ["id", 97]]
---
  def save_text
    @idea = Idea.find_by(id: split_params.last)
    render json: @idea.update_text(split_params.first, params[:contents])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 85]]
DELETE FROM "idea_tags" WHERE "idea_tags"."id" = $1  [["id", 3]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 85]]
---
  def destroy
    @idea = Idea.find_by(id: params[:id])
    @idea.idea_tags.destroy_all

SELECT "tags"."name" FROM "tags" INNER JOIN "idea_tags" ON "tags"."id" = "idea_tags"."tag_id" WHERE "idea_tags"."idea_id" = ?  [["idea_id", 131]]
---
  def tags
    tags_list = Idea.find_by(id: params[:id]).tags.pluck(:name).join(",")

SELECT "tags"."name" FROM "tags"
---
  def all_tags
    all_tags = Tag.all.pluck(:name)

SELECT "ideas".* FROM "ideas" INNER JOIN "idea_tags" ON "idea_tags"."idea_id" = "ideas"."id" INNER JOIN "tags" ON "tags"."id" = "idea_tags"."tag_id" WHERE "ideas"."name" = 'real'
---
  def by_tag
    render json: Idea.joins(:tags).where('tags.name = ?', params[:tag])