app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"  ORDER BY "ideas"."updated_at" DESC
---
def index
  @ideas = Idea.order(updated_at: :desc)