app/controllers/pages_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" IS NULL LIMIT 1
SELECT "ideas".* FROM "ideas"
---
def index
  @idea = Idea.find_by(id: params[:id])
  @ideas = Idea.all